{
	"BZDungeonsConfig": {
		/* 
		   How rare Bee Dungeons are. Higher numbers means more rare.
		   Default rate is 1. Setting to greater than 1000 will disable Bee Dungeons.
		*/
		"beeDungeonRarity": 2,
		/* 
		   How rare Spider Infested Bee Dungeons are. Higher numbers means more rare.
		   Default rate is 8. Setting to greater than 1000 will disable Spider Infested Bee Dungeons.
		*/
		"spiderInfestedBeeDungeonRarity": 10,
		/* 
		   How rare are Spider/Cave Spider Spawners in Spider Infested Bee Dungeons.
		   0 is no spawners, 1 is maximum spawners, and default is 0.2f
		*/
		"spawnerRateSpiderBeeDungeon": 0.25
	},
	"BZBeeAggressionConfig": {
		/* 
		   Determines if Wrath of the Hive can be applied to players outside
		   the Bumblezone dimension when they pick up Honey blocks, take honey
		    from Filled Porous Honey blocks, or drink Honey Bottles.
		*/
		"allowWrathOfTheHiveOutsideBumblezone": false,
		/* 
		   Show the orangish particles when you get Wrath of the Hive
		   after you angered the bees in the Bumblezone dimension.
		*/
		"showWrathOfTheHiveParticles": true,
		/* 
		   Turn off or on the ability to get Wrath of the Hive effect from certain actions.
		   
		   The bees can see you through walls and will have 
		   speed, absorption, and strength effects applied to them.
		   
		   Will also affect the bee's aggression toward other mobs in the dimension.
		   Note: Peaceful mode will always override the bee aggressive setting.
		*/
		"aggressiveBees": true,
		/* 
		   How far away the bee can be to become angry and hunt you down if
		   you take their honey from the Bumblezone dimension.
		   
		   Will also affect the bee's aggression range toward bears in the dimension.
		*/
		"aggressionTriggerRadius": 32,
		/* 
		   How long bees will keep their effects for (speed, absorption, strength).
		   
		   Note: This is in ticks. 20 ticks = 1 second. And bee's anger will remain.
		   Only the boosts given to the bees will be gone.
		*/
		"howLongWrathOfTheHiveLasts": 300,
		/* 
		   How long entities will keep Protection of the Hive effect after feeding bees
		   or Brood Blocks. Bees will attack anyone that damages someone with the effect.
		   
		   Note: This is in ticks. 20 ticks = 1 second.
		*/
		"howLongProtectionOfTheHiveLasts": 500,
		/* 
		   How fast bees move along the ground (Not while flying).
		   You will see this a lot when bees are about to attack
		   you, they tend to touch the floor and the speed boost
		   makes them dash forward at you. Set this to higher for
		   faster dash attacks from bees.
		*/
		"speedBoostLevel": 2,
		/* 
		   How much extra health bees get that always instantly regenerates.
		   This means you need to deal more damage than the extra health gives
		   order to actually damage the bee's real health bar.
		   
		   For example, Absorption 1 here makes bees get 4 extra padding of health (2 heart icons).
		   Your attacks need to deal 4 1/2 or more damage to actually be able to
		   kill the bee. This means using Bane of Arthropod 5 is needed to kill bees
		   if you set the absorption to a higher value like 2 or 3.
		   If you set this to like 5 or something, bees may be invicible! Game over.
		*/
		"absorptionBoostLevel": 1,
		/* 
		   How strong the bees attacks become.
		   (6 or higher will instant kill you without armor).
		*/
		"strengthBoostLevel": 3
	},
	"BZDimensionConfig": {
		/* 
		   How bright the fog is in the Bumblezone dimension. 
		   
		   The brightness is represented as a percentage so
		   0 will be pitch black, 50 will be half as 
		   bright, 100 will be normal orange brightness, and 
		   100000 will be white.
		*/
		"fogBrightnessPercentage": 100.0,
		/* 
		   Makes throwing Enderpearls at Bee Nests or Hives only
		    work in the Overworld. What this means setting this to true makes it 
		   only possible to enter The Bumblezone dimension from the Overworld
		*/
		"onlyOverworldHivesTeleports": false,
		/* 
		   Makes leaving The Bumblezone dimension always places you back
		    at the Overworld regardless of which dimension you originally 
		   came from. Use this option if this dimension becomes locked in 
		   with another dimension so you are stuck teleporting between the 
		   two and cannot get back to the Overworld
		*/
		"forceExitToOverworld": true,
		/* 
		   Should exiting The Bumblezone always try and place you
		   above sealevel in the target dimension? (Will only look
		   for beehives above sealevel as well when placing you)
		   ONLY FOR TELEPORTATION MODE 1 AND 3.
		*/
		"seaLevelOrHigherExitTeleporting": true,
		/* 
		   If requiredBlockUnderHive has a block specified and this config
		    is set to true, then player will get a warning if they throw
		   an Enderpearl at a Bee Nest/Beehive but the block under it is
		   not the correct required block. It will also tell the player what
		   block is needed under the Bee Nest/Beehive to teleport to the dimension.
		*/
		"warnPlayersOfWrongBlockUnderHive": true,
		/* 
		   Will a Beenest generate if no Beenest is 
		   found when leaving The Bumblezone dimension.
		   
		   ONLY FOR TELEPORTATION MODE 1.
		*/
		"generateBeenest": true,
		/* 
		   Which mode of teleportation should be used when
		   leaving The Bumblezone dimension.
		   
		   Mode 1: Coordinates will be converted to the other
		   dimension's coordinate scale and the game will look for
		   a Beenest/Beehive at the new spot to spawn players at.
		   If none is found, players will still be placed at the spot.
		   
		   Mode 2: Will always spawn players at the original spot
		   in the non-BZ dimension where they threw the Enderpearl
		   at a Beenest/Beehive.
		   Mode 3: Will use mode 1's teleportation method if Beehive/Beenest
		   is near the spot when exiting the dimension. If none is found, then
		   mode 2's teleportation method is used instead.
		*/
		"teleportationMode": 2
	},
	"BZBlockMechanicsConfig": {
		/* 
		   Should Dispensers always drop the Glass Bottle when using specific 
		   bottle items on certain The Bumblezone blocks? 
		   
		   Example: Using Honey Bottle to feed Honeycomb Brood Blocks will grow the larva and 
		   drop the Glass Bottle instead of putting it back into Dispenser if this is set to true.
		*/
		"dispensersDropGlassBottles": false,
		/* 
		   Brood Blocks will automatically spawn bees until the number of active bees is the value below. 
		   Set this higher to allow Brood Blocks to spawn more bees in a smaller area or set it to 0 to turn 
		   off automatic Brood Block bee spawning.
		*/
		"broodBlocksBeeSpawnCapacity": 50
	},
	"BZModCompatibilityConfig": {
		/* 
		   Allow Charm compat which adds more blocks to Bumblezone's worldgen!
		*/
		"allowCharmCandleCompat": true,
		/* 
		   Allow Charm villager trade compat which adds more trades to Charm's Beekeeper!!
		*/
		"allowCharmTradeCompat": true,
		/* 
		   Allow Bee Better compat which adds more blocks to Bumblezone's worldgen!
		*/
		"allowBeeBetterCompat": true,
		/* 
		   Allow Potion of Bees item to turn Empty Honeycomb Brood blocks 
		    back into Honeycomb Brood Blocks with a larva in it. (affects Dispenser too)
		*/
		"allowPotionOfBeesCompat": true,
		/* 
		   Allow Splash Potion of Bees item to turn Empty Honeycomb Brood 
		    blocks back into Honeycomb Brood Blocks with a larva in it when 
		    the potion is thrown and splashed near the block. (affects Dispenser too)
		*/
		"allowSplashPotionOfBeesCompat": true
	}
}